#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/5260d7e0-27af-4ba1-a10b-c2e8483b85d7/terraform-bin show -no-color plan.tmp

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_object.redirects["/commands/quality-checks/checks/change-drop-column-warn.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/change-drop-column-warn.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/change-drop-column-warn.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/change-drop-table-warn.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/change-drop-table-warn.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/change-drop-table-warn.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/change-truncate-table-warn.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/change-truncate-table-warn.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/change-truncate-table-warn.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/changeset-comment-check.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/changeset-comment-check.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/changeset-comment-check.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/changeset-context-check.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/changeset-context-check.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/changeset-context-check.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/changeset-label-check.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/changeset-label-check.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/changeset-label-check.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/constraint-must-exist.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/constraint-must-exist.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/database-checks/constraint-must-exist.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/modify-data-type-warn.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/modify-data-type-warn.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/modify-data-type-warn.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/object-name-must-match.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/object-name-must-match.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/database-checks/object-name-must-match.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/object-name-must-not-match.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/object-name-must-not-match.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/database-checks/object-name-must-not-match.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/oracle-reserved-keywords.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/oracle-reserved-keywords.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/oracle-reserved-keywords.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/postgres-non-reserved-keywords.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/postgres-non-reserved-keywords.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/postgres-non-reserved-keywords.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/postgres-reserved-keywords.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/postgres-reserved-keywords.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/postgres-reserved-keywords.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/primary-key-on-create-table.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/primary-key-on-create-table.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/primary-key-on-create-table.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/quality-checks-databases.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/quality-checks-databases.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/database-checks/home.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/require-chaneset-dis-uuid.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/require-chaneset-dis-uuid.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/require-changeset-dis-uuid.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/rollback-required.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/rollback-required.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/rollback-required.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/sql-grant-admin-warn.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/sql-grant-admin-warn.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/sql-grant-admin-warn.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/sql-grant-option-warn.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/sql-grant-option-warn.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/sql-grant-option-warn.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/sql-grant-specific-privs-warn.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/sql-grant-specific-privs-warn.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/sql-grant-specific-privs-warn.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/sql-grant-warn.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/sql-grant-warn.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/sql-grant-warn.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/sql-revoke-warn.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/sql-revoke-warn.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/sql-revoke-warn.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/sql-select-star-warn.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/sql-select-star-warn.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/sql-select-star-warn.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/sql-server-future-reserved-keywords.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/sql-server-future-reserved-keywords.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/sql-server-future-reserved-keywords.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/sql-server-odbc-reserved-keywords.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/sql-server-odbc-reserved-keywords.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/sql-server-odbc-reserved-keywords.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/sql-server-reserved-keywords.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/sql-server-reserved-keywords.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/sql-server-reserved-keywords.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/sql-user-defined-pattern-check.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/sql-user-defined-pattern-check.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/sql-user-defined-pattern-check.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/table-column-limit.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/table-column-limit.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/database-checks/table-column-limit.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/table-comment-check.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/table-comment-check.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/database-checks/table-comment-check.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/table-comment-pattern-check.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/table-comment-pattern-check.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/database-checks/table-comment-pattern-check.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/warn-on-use-database.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/warn-on-use-database.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/warn-on-use-database.html"
    }

Plan: 31 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_s3_object.redirects["/commands/quality-checks/checks/change-drop-column-warn.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/commands/quality-checks/checks/change-drop-column-warn.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/change-drop-column-warn.html"%0A    }%0A%0A  # aws_s3_object.redirects["/commands/quality-checks/checks/change-drop-table-warn.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/commands/quality-checks/checks/change-drop-table-warn.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/change-drop-table-warn.html"%0A    }%0A%0A  # aws_s3_object.redirects["/commands/quality-checks/checks/change-truncate-table-warn.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/commands/quality-checks/checks/change-truncate-table-warn.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/change-truncate-table-warn.html"%0A    }%0A%0A  # aws_s3_object.redirects["/commands/quality-checks/checks/changeset-comment-check.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/commands/quality-checks/checks/changeset-comment-check.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/changeset-comment-check.html"%0A    }%0A%0A  # aws_s3_object.redirects["/commands/quality-checks/checks/changeset-context-check.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/commands/quality-checks/checks/changeset-context-check.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/changeset-context-check.html"%0A    }%0A%0A  # aws_s3_object.redirects["/commands/quality-checks/checks/changeset-label-check.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/commands/quality-checks/checks/changeset-label-check.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/changeset-label-check.html"%0A    }%0A%0A  # aws_s3_object.redirects["/commands/quality-checks/checks/constraint-must-exist.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/commands/quality-checks/checks/constraint-must-exist.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/commands/quality-checks/checks/database-checks/constraint-must-exist.html"%0A    }%0A%0A  # aws_s3_object.redirects["/commands/quality-checks/checks/modify-data-type-warn.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/commands/quality-checks/checks/modify-data-type-warn.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/modify-data-type-warn.html"%0A    }%0A%0A  # aws_s3_object.redirects["/commands/quality-checks/checks/object-name-must-match.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/commands/quality-checks/checks/object-name-must-match.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/commands/quality-checks/checks/database-checks/object-name-must-match.html"%0A    }%0A%0A  # aws_s3_object.redirects["/commands/quality-checks/checks/object-name-must-not-match.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/commands/quality-checks/checks/object-name-must-not-match.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/commands/quality-checks/checks/database-checks/object-name-must-not-match.html"%0A    }%0A%0A  # aws_s3_object.redirects["/commands/quality-checks/checks/oracle-reserved-keywords.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/commands/quality-checks/checks/oracle-reserved-keywords.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/oracle-reserved-keywords.html"%0A    }%0A%0A  # aws_s3_object.redirects["/commands/quality-checks/checks/postgres-non-reserved-keywords.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/commands/quality-checks/checks/postgres-non-reserved-keywords.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/postgres-non-reserved-keywords.html"%0A    }%0A%0A  # aws_s3_object.redirects["/commands/quality-checks/checks/postgres-reserved-keywords.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/commands/quality-checks/checks/postgres-reserved-keywords.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/postgres-reserved-keywords.html"%0A    }%0A%0A  # aws_s3_object.redirects["/commands/quality-checks/checks/primary-key-on-create-table.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/commands/quality-checks/checks/primary-key-on-create-table.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/primary-key-on-create-table.html"%0A    }%0A%0A  # aws_s3_object.redirects["/commands/quality-checks/checks/quality-checks-databases.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/commands/quality-checks/checks/quality-checks-databases.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/commands/quality-checks/checks/database-checks/home.html"%0A    }%0A%0A  # aws_s3_object.redirects["/commands/quality-checks/checks/require-chaneset-dis-uuid.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/commands/quality-checks/checks/require-chaneset-dis-uuid.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/require-changeset-dis-uuid.html"%0A    }%0A%0A  # aws_s3_object.redirects["/commands/quality-checks/checks/rollback-required.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/commands/quality-checks/checks/rollback-required.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/rollback-required.html"%0A    }%0A%0A  # aws_s3_object.redirects["/commands/quality-checks/checks/sql-grant-admin-warn.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/commands/quality-checks/checks/sql-grant-admin-warn.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/sql-grant-admin-warn.html"%0A    }%0A%0A  # aws_s3_object.redirects["/commands/quality-checks/checks/sql-grant-option-warn.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/commands/quality-checks/checks/sql-grant-option-warn.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/sql-grant-option-warn.html"%0A    }%0A%0A  # aws_s3_object.redirects["/commands/quality-checks/checks/sql-grant-specific-privs-warn.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/commands/quality-checks/checks/sql-grant-specific-privs-warn.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/sql-grant-specific-privs-warn.html"%0A    }%0A%0A  # aws_s3_object.redirects["/commands/quality-checks/checks/sql-grant-warn.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/commands/quality-checks/checks/sql-grant-warn.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/commands/quality-checks/checks/changelog-checks/sql-grant-warn.html"%0A    }%0A%0A  # aws_s3_object.redirects["/commands/quality-checks/checks/sql-revoke-warn.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = ( ...
```

</details>
Output is too long and was truncated. You can read full Plan in <a href="https://github.com/liquibase/liquibase-docs/actions/runs/6788241207">Actions</a>.<br /><br />

*Pusher: @adrian-velonis1, Action: `pull_request`, Working Directory: `/home/runner/work/liquibase-docs/liquibase-docs`, Workflow: `Publish Redirects to Staging for Docs`*